hardware/latches-and-flipflops.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Understanding latches and flip-flops</title>
<meta property="og:title" content="Understanding latches and flip-flops" />
<meta name="author" content="8dcc" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/x-icon" href="../img/favicon.png">
<link rel="stylesheet" type="text/css" href="../css/main.css">
</head>
<body>
<div id="org-div-home-and-up">
  <a accesskey="u" href="index.html">Up</a> | <a accesskey="h" href="../index.html">Home</a>
</div><div id="content" class="content">
<h1 class="title">Understanding latches and flip-flops</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#introduction">1. Introduction</a></li>
<li><a href="#sr-latch">2. SR Latch</a></li>
<li><a href="#gated-sr-latch">3. Gated SR Latch</a></li>
</ul>
</div>
</div>

<div id="outline-container-introduction" class="outline-2">
<h2 id="introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-introduction">
<p>
This article covers latches and flip-flops, two kinds of bistable circuits used
in electronics.
</p>

<p>
Bistable circuits are those which can remain indefinitely stable in one of two
possible states. This can be extremely useful, as it allows the circuit to store
or &ldquo;remember&rdquo; a bit of memory (i.e., a digital signal which is high or low, 1 or
0). This is usually accomplished through retroalimentation; some outputs are fed
back into the circuit, self-reinforcing the current state indefinitely.
</p>

<p>
Note that all diagrams are interactive, and are rendered and simulated in the
browser through <a href="https://github.com/8dcc/logic-diagram.js">a custom JavaScript library</a>; the inputs can be toggled, and the
state of the circuit will change accordingly.
</p>
</div>
</div>

<div id="outline-container-sr-latch" class="outline-2">
<h2 id="sr-latch"><span class="section-number-2">2.</span> SR Latch</h2>
<div class="outline-text-2" id="text-sr-latch">
<p>
The SR latch is the most basic form of latch, and it is used to built the rest
of the latches and flip-flops.
</p>

<p>
It has two inputs, <i>S</i> and <i>R</i>, which stand for &ldquo;Set&rdquo;
and &ldquo;Reset&rdquo;. When both inputs are low, the circuit outputs its stored value
through <i>Q</i>. When input <i>S</i> becomes high, the circuit stores a high signal;
similarly, when input <i>R</i> becomes high, the circuit stores a low signal. The <i>~Q</i>
output stores the inverted value of <i>Q</i>. Both inputs are not supposed to be high;
that is considered an invalid input, since both <i>Q</i> and <i>~Q</i> would become low.
</p>

<p>
The circuit is composed of two NOR gates, and the output of each one is fed back
into the other. This is what causes the stabilization, if both inputs are low,
when one of the NOR gates outputs a low signal, it is fed into the other gate,
producing a high signal which is then fed back into the other, keeping that
original signal low indefinitely.
</p>

<script type="text/logicdiag">
    input R
    input S

    stage 1
    nor nor_A  R nor_B
    nor nor_B  nor_A S

    output nor_A "Q"
    output nor_B "~Q"
</script>

<p>
An alternative version of this latch will be shown below. It uses NAND gates
instead of NOR gates, which can be desirable in some scenarios. It uses the same
retroalimentation principle, but the circuit reacts to low inputs instead of
high ones; both <i>S</i> and <i>R</i> are high by default, and a low signal is used to set or
reset the stored value.
</p>
</div>
</div>

<div id="outline-container-gated-sr-latch" class="outline-2">
<h2 id="gated-sr-latch"><span class="section-number-2">3.</span> Gated SR Latch</h2>
<div class="outline-text-2" id="text-gated-sr-latch">
<p>
The gated SR latch is simply a regular SR latch with an extra input <i>E</i>, which
controls, through two new AND gates, whether inputs <i>S</i> and <i>R</i> are enabled or
disabled. If the <i>E</i> signal is low, the SR latch doesn&rsquo;t receive any updates from
the other inputs, holding its &ldquo;stored&rdquo; value.
</p>

<script type="text/logicdiag">
    input R
    row 0.5
    input E
    row 1
    input S

    stage 1
    and and_A R E
    and and_B E S

    # SR Latch rectangle
    label "SR Latch" 1.9 -0.6
    rect 1.3 -0.5 2.6 1.5

    # SR Latch
    stage 2
    nor nor_A  and_A nor_B
    nor nor_B  nor_A and_B

    output nor_A "Q"
    output nor_B "~Q"
</script>

<p>
An alternative version of the gated SR latch can be built with only 4 NAND
gates. This is convenient in most applications, since NAND gates are cheaper to
fabricate on chips than NOR gates.
</p>

<p>
In the following diagram, notice how input <i>S</i> is on top, aligned with output <i>Q</i>,
and input <i>R</i> is at the bottom, aligned with <i>~Q</i>. This is because the entire logic
of the circuit is &ldquo;inverted&rdquo;; the two AND gates from the previous circuit are
negated into NAND gates, producing a low signal when both inputs are high. The
NOR gates are just replaced to compensate for this change.
</p>

<script type="text/logicdiag">
    input S
    row 0.5
    input E
    row 1
    input R

    stage 1
    nand nand_A S E
    nand nand_B E R

    stage 2
    nand nand_C  nand_A nand_D
    nand nand_D  nand_C nand_B

    output nand_C "Q"
    output nand_D "~Q"
</script>
</div>
</div>
</div>
</body>
</html>
